tap "blender/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/test-bot"
tap "neovim/neovim"
tap "thoughtbot/formulae"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Decentralized dependency manager for Cocoa
brew "carthage"
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Reimplementation of ctags(1)
brew "ctags"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# Command-line fuzzy finder written in Go
brew "fzf"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Framework and command-line tool for interacting with SourceKit
brew "sourcekitten"
# Meta-programming for Swift, stop writing boilerplate code
brew "sourcery"
# User interface to the TELNET protocol (built from macOS Sierra sources)
brew "telnet"
# Code-search similar to ack
brew "the_silver_searcher"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Download YouTube videos from the command-line
brew "youtube-dl"
# A shared cache tool for Carthage
brew "blender/tap/rome"
# management suite for dotfiles
brew "thoughtbot/formulae/rcm"
cask "alfred"
cask "charles"
cask "dropbox"
cask "fantastical"
cask "istat-menus"
cask "karabiner-elements"
cask "marked"
cask "reveal"
cask "sketch"
cask "slack"
cask "sublime-text"
cask "taskpaper"
cask "textmate"
cask "vimr"
